About the Dataset
The purpose of this fictional sales dataset is to facilitate data analysis practice. Before analysis, the three tables must be joined to provide a cohesive dataset.

This dataset includes three tables:

Customer Dimension (History Preserving)

Contains unique customer IDs, addresses, ages, and indicators of current records.
Includes effective start and end dates for each customer.
Product Dimension (History Preserving)

Contains unique product IDs, names, prices, and their validity periods.
Includes indicators of current price records.
Sales Transactions

Captures sales activities with unique order IDs, product IDs, customer IDs, quantities sold, and order dates.
Together, these datasets offer a comprehensive view of customer demographics, product pricing history, and sales transactions, providing a robust foundation for data analysis.

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
#Importing data from csv files.  Loading data requirement.
customer = pd.read_csv("customer_dim.csv")
product = pd.read_csv("product_dim.csv")
sales = pd.read_csv("sales_transactions.csv")

In [4]:
#Inspecting the customer data set.
customer.head()

,cust_id,cust_address,cust_age,effective_start_date,effective_end_date,current_ind
0,185057,"335 Meadow St, Los Angeles, CA 90001",15,1900-01-01,9999-12-31,Y
1,225569,"753 Adams St, Portland, ME 04101",15,1900-01-01,9999-12-31,Y
2,134924,"295 Dogwood St, New York City, NY 10001",15,1900-01-01,9999-12-31,Y
3,218931,"40 Jefferson St, Atlanta, GA 30301",15,1900-01-01,9999-12-31,Y
4,140361,"169 Lake St, Boston, MA 02215",15,1900-01-01,9999-12-31,Y

In [5]:
customer.tail()

,cust_id,cust_address,cust_age,effective_start_date,effective_end_date,current_ind
140782,119941,"46 Forest St, Dallas, TX 75001",86,1900-01-01,9999-12-31,Y
140783,174908,"565 Hickory St, San Francisco, CA 94016",86,1900-01-01,9999-12-31,Y
140784,202462,"456 South St, San Francisco, CA 94016",86,1900-01-01,9999-12-31,Y
140785,165763,"246 Johnson St, San Francisco, CA 94016",86,1900-01-01,9999-12-31,Y
140786,147936,"135 Hill St, Seattle, WA 98101",86,1900-01-01,9999-12-31,Y

In [6]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 140787 entries, 0 to 140786
Data columns (total 6 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   cust_id               140787 non-null  int64
 1   cust_address          140787 non-null  object
 2   cust_age              140787 non-null  int64
 3   effective_start_date  140787 non-null  object
 4   effective_end_date    140787 non-null  object
 5   current_ind           140787 non-null  object
dtypes: int64(2), object(4)
memory usage: 6.4+ MB

In [7]:
#The effective_start_date and effective_end_date columns begin in the year 1900 and end in the year 9999.  
# Both columns will be dropped from the dataset being they contain no relative info.
customer.drop(['effective_start_date', 'effective_end_date'], axis=1, inplace=True)

In [8]:
#Inspecting the product dataset.
product.head()

,product_id,product_name,product_price,effective_start_date,effective_end_date,current_ind
0,582,iPhone,635.0,2019-10-01,2019-11-30,N
1,582,iPhone,689.0,2019-06-01,2019-09-30,N
2,582,iPhone,649.0,2019-04-01,2019-05-31,N
3,582,iPhone,700.0,1900-01-01,2019-03-31,N
4,216,LG Dryer,610.0,2019-06-01,2019-06-30,N

In [9]:
product.tail()

,product_id,product_name,product_price,effective_start_date,effective_end_date,current_ind
116,692,AAA Batteries (4-pack),2.89,2019-12-01,9999-12-31,Y
117,953,Apple Airpods Headphones,139.00,2019-12-01,9999-12-31,Y
118,435,Golf Handheld GPS Caddie,350.00,2019-12-01,9999-12-31,Y
119,981,Lightning Charging Cable,10.99,2019-12-01,9999-12-31,Y
120,467,Bose SoundSport Headphones,104.99,2019-12-01,9999-12-31,Y

In [10]:
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   product_id            121 non-null    int64
 1   product_name          121 non-null    object
 2   product_price         121 non-null    float64
 3   effective_start_date  121 non-null    object
 4   effective_end_date    121 non-null    object
 5   current_ind           121 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 5.8+ KB

In [11]:
#Changing both effective_start_date and effective_end_date to date/time format.
product['effective_start_date'] = pd.to_datetime(product['effective_start_date'])
product['effective_end_date'] = pd.to_datetime(product['effective_end_date'], errors='coerce')

In [12]:
#Ensuring the dtypes changed for both effective_start_date and effective_end_date
product.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 121 entries, 0 to 120
Data columns (total 6 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   product_id            121 non-null    int64
 1   product_name          121 non-null    object
 2   product_price         121 non-null    float64
 3   effective_start_date  121 non-null    datetime64[ns]
 4   effective_end_date    102 non-null    datetime64[ns]
 5   current_ind           121 non-null    object
dtypes: datetime64[ns](2), float64(1), int64(1), object(2)
memory usage: 5.8+ KB

In [13]:
#Inspecting the sales data.
sales.head()

   order_id  product_id  cust_id  product_quantity  order_date
0    146740         614   121960                 1  2019-01-24
1    141749         394   113809                 1  2019-01-24
2    144400         953   102255                 1  2019-01-24
3    148898         715   190891                 1  2019-01-24
4    143260         467   108376                 1  2019-01-24

In [14]:
sales.tail()

        order_id  product_id  cust_id  product_quantity  order_date
185945    267890         692   206766                 3  2019-10-06
185946    271869         692   203170                 3  2019-10-06
185947    266115         692   144006                 3  2019-10-06
185948    277783         692   194323                 4  2019-10-06
185949    274286         692   208841                 5  2019-10-06

In [15]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185950 entries, 0 to 185949
Data columns (total 5 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   order_id          185950 non-null  int64
 1   product_id        185950 non-null  int64
 2   cust_id           185950 non-null  int64
 3   product_quantity  185950 non-null  int64
 4   order_date        185950 non-null  object
dtypes: int64(4), object(1)
memory usage: 7.1+ MB

In [16]:
#Converting order_date to datetime format in the sales dateframe.
sales['order_date'] = pd.to_datetime(sales['order_date'])

In [18]:
#Merging the 3 datasets for analysis.
df = pd.merge(sales, customer, on='cust_id')
df = pd.merge(df, product, on='product_id')

In [19]:
#With this dataset the order_id was duplicated to match each price for the product. 
df.head()

,order_id,product_id,cust_id,product_quantity,order_date,cust_address,cust_age,current_ind_x,product_name,product_price,effective_start_date,effective_end_date,current_ind_y
0,146740,614,121960,1,2019-01-24,"734 Maple St, San Francisco, CA 94016",36,Y,Google Phone,610.0,2019-06-01,2019-09-30,N
1,146740,614,121960,1,2019-01-24,"734 Maple St, San Francisco, CA 94016",36,Y,Google Phone,579.0,2019-10-01,2019-10-31,N
2,146740,614,121960,1,2019-01-24,"734 Maple St, San Francisco, CA 94016",36,Y,Google Phone,599.0,2019-03-01,2019-05-31,N
3,146740,614,121960,1,2019-01-24,"734 Maple St, San Francisco, CA 94016",36,Y,Google Phone,620.0,1900-01-01,2019-02-28,N
4,146740,614,121960,1,2019-01-24,"734 Maple St, San Francisco, CA 94016",36,Y,Google Phone,589.0,2019-11-01,2019-11-30,N

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1345882 entries, 0 to 1345881
Data columns (total 13 columns):
 #   Column                Non-Null Count    Dtype
---  ------                --------------    -----
 0   order_id              1345882 non-null  int64
 1   product_id            1345882 non-null  int64
 2   cust_id               1345882 non-null  int64
 3   product_quantity      1345882 non-null  int64
 4   order_date            1345882 non-null  datetime64[ns]
 5   cust_address          1345882 non-null  object
 6   cust_age              1345882 non-null  int64
 7   current_ind_x         1345882 non-null  object
 8   product_name          1345882 non-null  object
 9   product_price         1345882 non-null  float64
 10  effective_start_date  1345882 non-null  datetime64[ns]
 11  effective_end_date    1159932 non-null  datetime64[ns]
 12  current_ind_y         1345882 non-null  object
dtypes: datetime64[ns](3), float64(1), int64(5), object(4)
memory usage: 133.5+ MB

In [21]:
#Removing all duplicate order_id to shrink the df dataset.
df.drop_duplicates(subset='order_id', inplace=True)